###  Part # 1
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/c19f39a8-98be-43d3-86c2-3d100874e9b2/terraform-bin show -no-color tf.plan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_instance.ansibleinstance[0] has been deleted
  - resource "aws_instance" "ansibleinstance" {
      - ami                                  = "ami-05f408238af346b4f" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-06c3474e12d3be1f2" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1c" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-06c3474e12d3be1f2" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "projectkey" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0b7906dcf37ab93f9" -> null
      - private_dns                          = "ip-10-1-3-126.ec2.internal" -> null
      - private_ip                           = "10.1.3.126" -> null
      - public_ip                            = "3.231.95.227" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "sg-0ec4cbd2e16f765a6",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-02503b7e9030a050f" -> null
      - tags                                 = {
          - "App"   = "Web"
          - "Name"  = "prod-AnsibleVM-3"
          - "Owner" = "Group10"
        } -> null
      - tags_all                             = {
          - "App"   = "Web"
          - "Name"  = "prod-AnsibleVM-3"
          - "Owner" = "Group10"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0ec4cbd2e16f765a6",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = true -> null
          - iops                  = 100 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0c959dae8dc030e5c" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.ansibleinstance[1] has been deleted
  - resource "aws_instance" "ansibleinstance" {
      - ami                         = "ami-05f408238af346b4f" -> null
      - associate_public_ip_address = true -> null
      - get_password_data           = false -> null
      - id                          = "i-091da0565ad08712c" -> null
      - instance_type               = "t2.micro" -> null
      - key_name                    = "projectkey" -> null
      - secondary_private_ips       = [] -> null
      - security_groups             = [
          - "sg-0ec4cbd2e16f765a6",
        ] -> null
      - source_dest_check           = true -> null
      - subnet_id                   = "subnet-0060587b2b853bb81" -> null
      - tags                        = {
          - "App"   = "Web"
          - "Name"  = "prod-AnsibleVM-4"
          - "Owner" = "Group10"
        } -> null
      - tags_all                    = {
          - "App"   = "Web"
          - "Name"  = "prod-AnsibleVM-4"
          - "Owner" = "Group10"
        } -> null
      - user_data_replace_on_change = false -> null
      - vpc_security_group_ids      = [] -> null

      - root_block_device {
          - delete_on_termination = true -> null
          - encrypted             = true -> null
          - iops                  = 0 -> null
          - throughput            = 0 -> null
          - volume_size           = 0 -> null
        }
    }

  # aws_instance.bastion[0] has changed
  ~ resource "aws_instance" "bastion" {
        id                                   = "i-03548c74861b14bc4"
      ~ security_groups                      = [
          - "sg-0043e500cee2dacde",
        ]
        tags                                 = {
            "Name" = "prod-Bastion-1"
        }
        # (30 unchanged attributes hidden)







      ~ root_block_device {
          + tags                  = {}
            # (9 unchanged attributes hidden)
        }
        # (6 unchanged blocks hidden)
    }

  # aws_instance.privateinstance[0] has been deleted
  - resource "aws_instance" "privateinstance" {
      - ami                         = "ami-05f408238af346b4f" -> null
      - associate_public_ip_address = false -> null
      - get_password_data           = false -> null
      - id                          = "i-0815f62e4554a77f6" -> null
      - instance_type               = "t2.micro" -> null
      - key_name                    = "projectkey" -> null
      - secondary_private_ips       = [] -> null
      - security_groups             = [
          - "sg-01db37fc898c7eb8a",
        ] -> null
      - source_dest_check           = true -> null
      - subnet_id                   = "subnet-0c892027b6c39593e" -> null
      - tags                        = {
          - "Name" = "prod-PrivateVM-1"
        } -> null
      - tags_all                    = {
          - "Name" = "prod-PrivateVM-1"
        } -> null
      - user_data_replace_on_change = false -> null
      - vpc_security_group_ids      = [] -> null

      - root_block_device {
          - delete_on_termination = true -> null
          - encrypted             = true -> null
          - iops                  = 0 -> null
          - throughput            = 0 -> null
          - volume_size           = 0 -> null
        }
    }

  # aws_instance.privateinstance[1] has changed
  ~ resource "aws_instance" "privateinstance" {
        id                                   = "i-0a8a3e491065699ea"
      ~ security_groups                      = [
          - "sg-01db37fc898c7eb8a",
        ]
        tags                                 = {
            "Name" = "prod-PrivateVM-2"
        }
        # (28 unchanged attributes hidden)







      ~ root_block_device {
          + tags                  = {}
            # (9 unchanged attributes hidden)
        }
        # (6 unchanged blocks hidden)
    }

  # aws_instance.tfinstance[0] has been deleted
  - resource "aws_instance" "tfinstance" {
      - ami                         = "ami-05f408238af346b4f" -> null
      - associate_public_ip_address = true -> null
      - get_password_data           = false -> null
      - id                          = "i-0f7b261d140bdfdf4" -> null
      - instance_type               = "t2.micro" -> null
      - key_name                    = "projectkey" -> null
      - secondary_private_ips       = [] -> null
      - security_groups             = [
          - "sg-0ec4cbd2e16f765a6",
        ] -> null
      - source_dest_check           = true -> null
      - subnet_id                   = "subnet-090e0a68433c6b3b1" -> null
      - tags                        = {
          - "Name" = "prod-TFVM-1"
        } -> null
      - tags_all                    = {
          - "Name" = "prod-TFVM-1"
        } -> null
      - user_data                   = "1f7d5905591ac289eec3d058f221d674c5077417" -> null
      - user_data_replace_on_change = false -> null
      - vpc_security_group_ids      = [] -> null

      - root_block_device {
          - delete_on_termination = true -> null
          - encrypted             = true -> null
          - iops                  = 0 -> null
          - throughput            = 0 -> null
          - volume_size           = 0 -> null
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_instance.ansibleinstance[0] will be created
  + resource "aws_instance" "ansibleinstance" {
      + ami                                  = "ami-05f408238af346b4f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "projectkey"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-0ec4cbd2e16f765a6",
        ]
      + source_dest_check                    = true
      + subnet_id                            = "subnet-02503b7e9030a050f"
      + tags                                 = {
          + "App"   = "Web"
          + "Name"  = "prod-AnsibleVM-3"
          + "Owner" = "Group10"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Name"  = "prod-AnsibleVM-3"
          + "Owner" = "Group10"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.ansibleinstance[1] will be created
  + resource "aws_instance" "ansibleinstance" {
      + ami                                  = "ami-05f408238af346b4f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "projectkey"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-0ec4cbd2e16f765a6",
        ]
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0060587b2b853bb81"
      + tags                                 = {
          + "App"   = "Web"
          + "Name"  = "prod-AnsibleVM-4"
          + "Owner" = "Group10"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Name"  = "prod-AnsibleVM-4"
          + "Owner" = "Group10"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.ansibleinstance[1] (deposed object fe1421a9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_instance" "ansibleinstance" {
      - ami                                  = "ami-05f408238af346b4f" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0c45380fb1710734d" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1d" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0c45380fb1710734d" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "projectkey" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0e43d987a2e7aff9c" -> null
      - private_dns                          = "ip-10-1-4-21.ec2.internal" -> null
      - private_ip                           = "10.1.4.21" -> null
      - public_ip                            = "44.202.251.70" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0060587b2b853bb81" -> null
      - tags                                 = {
          - "App"   = "Web"
          - "Name"  = "prod-AnsibleVM-4"
          - "Owner" = "Group10"
        } -> null
      - tags_all                             = {
          - "App"   = "Web"
          - "Name"  = "prod-AnsibleVM-4"
          - "Owner" = "Group10"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0ec4cbd2e16f765a6",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = true -> null
          - iops                  = 100 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ab6dfe1d2914893c" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.bastion[0] must be replaced
+/- resource "aws_instance" "bastion" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-03548c74861b14bc4" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-03548c74861b14bc4" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-04d64134a4995bd20" -> (known after apply)
      ~ private_dns                          = "ip-10-1-2-5.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.2.5" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "3.81.113.198" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-0043e500cee2dacde",
        ]
        tags                                 = {
            "Name" = "prod-Bastion-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0043e500cee2dacde",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-0cfebc85206ee66cf" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_instance.privateinstance[0] will be created
  + resource "aws_instance" "privateinstance" {
      + ami                                  = "ami-05f408238af346b4f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = false
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "projectkey"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-01db37fc898c7eb8a",
        ]
      + source_dest_check                    = true
      + subnet_id                            = "subnet-0c892027b6c39593e"
      + tags                                 = {
          + "Name" = "prod-PrivateVM-1"
        }
      + tags_all                             = {
          + "Name" = "prod-PrivateVM-1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.privateinstance[0] (deposed object 444746ac) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_instance" "privateinstance" {
      - ami                                  = "ami-05f408238af346b4f" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0dcb1e2d60e6d9691" -> null
      - associate_public_ip_address          = false -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0dcb1e2d60e6d9691" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "projectkey" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-05c711f160ef8b886" -> null
      - private_dns                          = "ip-10-1-5-183.ec2.internal" -> null
      - private_ip                           = "10.1.5.183" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-0c892027b6c39593e" -> null
      - tags                                 = {
          - "Name" = "prod-PrivateVM-1"
        } -> null
      - tags_all                             = {
          - "Name" = "prod-PrivateVM-1"
        } -> null
      - tenancy                              = "default" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-01db37fc898c7eb8a",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = true -> null
          - iops                  = 100 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0f2a0fd72f0c66c7c" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.privateinstance[1] must be replaced
+/- resource "aws_instance" "privateinstance" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0a8a3e491065699ea" -> (known after apply)
      ~ availability_zone                    = "us-east-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-0a8a3e491065699ea" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-02dbcc431560851ec" -> (known after apply)
      ~ private_dns                          = "ip-10-1-6-242.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.1.6.242" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [ # forces replacement
          + "sg-01db37fc898c7eb8a",
        ]
        tags                                 = {
            "Name" = "prod-PrivateVM-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-01db37fc898c7eb8a",
        ] -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "optional" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-04946ed9ef802c385" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_instance.tfinstance[0] will be created
  + resource "aws_instance" "tfinstance" {
      + ami                                  = "ami-05f408238af346b4f"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "projectkey"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = [
          + "sg-0ec4cbd2e16f765a6",
        ]
      + source_dest_check                    = true
      + subnet_id                            = "subnet-090e0a68433c6b3b1"
      + tags                                 = {
          + "Name" = "prod-TFVM-1"
        }
      + tags_all                             = {
          + "Name" = "prod-TFVM-1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "1f7d5905591ac289eec3d058f221d674c5077417"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_instance.tfinstance[0] (deposed object 26c7fec9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_instance" "tfinstance" {
      - ami                                  = "ami-05f408238af346b4f" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-0ab3336b0b9ac4ec1" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1a" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-0ab3336b0b9ac4ec1" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - key_name                             = "projectkey" -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-0591532ea5d058848" -> null
      - private_dns                          = "ip-10-1-1-176.ec2.internal" -> null
      - private_ip                           = "10.1.1.176" -> null
      - public_ip                            = "54.221.3.60" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-090e0a68433c6b3b1" -> null
      - tags                                 = {
          - "Name" = "prod-TFVM-1"
        } -> null
      - tags_all                             = {
          - "Name" = "prod-TFVM-1"
        } -> null
      - tenancy                              = "default" -> null
      - user_data                            = "1f7d5905591ac289eec3d058f221d674c5077417" -> null
      - user_data_replace_on_change          = false -> null
      - vpc_security_group_ids               = [
          - "sg-0ec4cbd2e16f765a6",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = true -> null
          - iops                  = 100 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0cba570e80773bdf4" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 6 to add, 0 to change, 5 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply":%0A%0A  # aws_instance.ansibleinstance[0] has been deleted%0A  - resource "aws_instance" "ansibleinstance" {%0A      - ami                                  = "ami-05f408238af346b4f" -> null%0A      - arn                                  = "arn:aws:ec2:us-east-1:212474691643:instance/i-06c3474e12d3be1f2" -> null%0A      - associate_public_ip_address          = true -> null%0A      - availability_zone                    = "us-east-1c" -> null%0A      - cpu_core_count                       = 1 -> null%0A      - cpu_threads_per_core                 = 1 -> null%0A      - disable_api_stop                     = false -> null%0A      - disable_api_termination              = false -> null%0A      - ebs_optimized                        = false -> null%0A      - get_password_data                    = false -> null%0A      - hibernation                          = false -> null%0A      - id                                   = "i-06c3474e12d3be1f2" -> null%0A      - instance_initiated_shutdown_behavior = "stop" -> null%0A      - instance_state                       = "running" -> null%0A      - instance_type                        = "t2.micro" -> null%0A      - ipv6_address_count                   = 0 -> null%0A      - ipv6_addresses                       = [] -> null%0A      - key_name                             = "projectkey" -> null%0A      - monitoring                           = false -> null%0A      - primary_network_interface_id         = "eni-0b7906dcf37ab93f9" -> null%0A      - private_dns                          = "ip-10-1-3-126.ec2.internal" -> null%0A      - private_ip                           = "10.1.3.126" -> null%0A      - public_ip                            = "3.231.95.227" -> null%0A      - secondary_private_ips                = [] -> null%0A      - security_groups                      = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ] -> null%0A      - source_dest_check                    = true -> null%0A      - subnet_id                            = "subnet-02503b7e9030a050f" -> null%0A      - tags                                 = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-AnsibleVM-3"%0A          - "Owner" = "Group10"%0A        } -> null%0A      - tags_all                             = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-AnsibleVM-3"%0A          - "Owner" = "Group10"%0A        } -> null%0A      - tenancy                              = "default" -> null%0A      - user_data_replace_on_change          = false -> null%0A      - vpc_security_group_ids               = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ] -> null%0A%0A      - capacity_reservation_specification {%0A          - capacity_reservation_preference = "open" -> null%0A        }%0A%0A      - credit_specification {%0A          - cpu_credits = "standard" -> null%0A        }%0A%0A      - enclave_options {%0A          - enabled = false -> null%0A        }%0A%0A      - maintenance_options {%0A          - auto_recovery = "default" -> null%0A        }%0A%0A      - metadata_options {%0A          - http_endpoint               = "enabled" -> null%0A          - http_put_response_hop_limit = 1 -> null%0A          - http_tokens                 = "optional" -> null%0A          - instance_metadata_tags      = "disabled" -> null%0A        }%0A%0A      - private_dns_name_options {%0A          - enable_resource_name_dns_a_record    = false -> null%0A          - enable_resource_name_dns_aaaa_record = false -> null%0A          - hostname_type                        = "ip-name" -> null%0A        }%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - device_name           = "/dev/xvda" -> null%0A          - encrypted             = true -> null%0A          - iops                  = 100 -> null%0A          - kms_key_id            = "arn:aws:kms:us-east-1:212474691643:key/e6303085-321e-4fb2-b265-e16d86022228" -> null%0A          - throughput            = 0 -> null%0A          - volume_id             = "vol-0c959dae8dc030e5c" -> null%0A          - volume_size           = 8 -> null%0A          - volume_type           = "gp2" -> null%0A        }%0A    }%0A%0A  # aws_instance.ansibleinstance[1] has been deleted%0A  - resource "aws_instance" "ansibleinstance" {%0A      - ami                         = "ami-05f408238af346b4f" -> null%0A      - associate_public_ip_address = true -> null%0A      - get_password_data           = false -> null%0A      - id                          = "i-091da0565ad08712c" -> null%0A      - instance_type               = "t2.micro" -> null%0A      - key_name                    = "projectkey" -> null%0A      - secondary_private_ips       = [] -> null%0A      - security_groups             = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ] -> null%0A      - source_dest_check           = true -> null%0A      - subnet_id                   = "subnet-0060587b2b853bb81" -> null%0A      - tags                        = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-AnsibleVM-4"%0A          - "Owner" = "Group10"%0A        } -> null%0A      - tags_all                    = {%0A          - "App"   = "Web"%0A          - "Name"  = "prod-AnsibleVM-4"%0A          - "Owner" = "Group10"%0A        } -> null%0A      - user_data_replace_on_change = false -> null%0A      - vpc_security_group_ids      = [] -> null%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - encrypted             = true -> null%0A          - iops                  = 0 -> null%0A          - throughput            = 0 -> null%0A          - volume_size           = 0 -> null%0A        }%0A    }%0A%0A  # aws_instance.bastion[0] has changed%0A  ~ resource "aws_instance" "bastion" {%0A        id                                   = "i-03548c74861b14bc4"%0A      ~ security_groups                      = [%0A          - "sg-0043e500cee2dacde",%0A        ]%0A        tags                                 = {%0A            "Name" = "prod-Bastion-1"%0A        }%0A        # (30 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A      ~ root_block_device {%0A          + tags                  = {}%0A            # (9 unchanged attributes hidden)%0A        }%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.privateinstance[0] has been deleted%0A  - resource "aws_instance" "privateinstance" {%0A      - ami                         = "ami-05f408238af346b4f" -> null%0A      - associate_public_ip_address = false -> null%0A      - get_password_data           = false -> null%0A      - id                          = "i-0815f62e4554a77f6" -> null%0A      - instance_type               = "t2.micro" -> null%0A      - key_name                    = "projectkey" -> null%0A      - secondary_private_ips       = [] -> null%0A      - security_groups             = [%0A          - "sg-01db37fc898c7eb8a",%0A        ] -> null%0A      - source_dest_check           = true -> null%0A      - subnet_id                   = "subnet-0c892027b6c39593e" -> null%0A      - tags                        = {%0A          - "Name" = "prod-PrivateVM-1"%0A        } -> null%0A      - tags_all                    = {%0A          - "Name" = "prod-PrivateVM-1"%0A        } -> null%0A      - user_data_replace_on_change = false -> null%0A      - vpc_security_group_ids      = [] -> null%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - encrypted             = true -> null%0A          - iops                  = 0 -> null%0A          - throughput            = 0 -> null%0A          - volume_size           = 0 -> null%0A        }%0A    }%0A%0A  # aws_instance.privateinstance[1] has changed%0A  ~ resource "aws_instance" "privateinstance" {%0A        id                                   = "i-0a8a3e491065699ea"%0A      ~ security_groups                      = [%0A          - "sg-01db37fc898c7eb8a",%0A        ]%0A        tags                                 = {%0A            "Name" = "prod-PrivateVM-2"%0A        }%0A        # (28 unchanged attributes hidden)%0A%0A%0A%0A%0A%0A%0A%0A      ~ root_block_device {%0A          + tags                  = {}%0A            # (9 unchanged attributes hidden)%0A        }%0A        # (6 unchanged blocks hidden)%0A    }%0A%0A  # aws_instance.tfinstance[0] has been deleted%0A  - resource "aws_instance" "tfinstance" {%0A      - ami                         = "ami-05f408238af346b4f" -> null%0A      - associate_public_ip_address = true -> null%0A      - get_password_data           = false -> null%0A      - id                          = "i-0f7b261d140bdfdf4" -> null%0A      - instance_type               = "t2.micro" -> null%0A      - key_name                    = "projectkey" -> null%0A      - secondary_private_ips       = [] -> null%0A      - security_groups             = [%0A          - "sg-0ec4cbd2e16f765a6",%0A        ] -> null%0A      - source_dest_check           = true -> null%0A      - subnet_id                   = "subnet-090e0a68433c6b3b1" -> null%0A      - tags                        = {%0A          - "Name" = "prod-TFVM-1"%0A        } -> null%0A      - tags_all                    = {%0A          - "Name" = "prod-TFVM-1"%0A        } -> null%0A      - user_data                   = "1f7d5905591ac289eec3d058f221d674c5077417" -> null%0A      - user_data_replace_on_change = false -> null%0A      - vpc_security_group_ids      = [] -> null%0A%0A      - root_block_device {%0A          - delete_on_termination = true -> null%0A          - encrypted             = true -> null%0A          - iops                  = 0 -> null%0A          - throughput            = 0 -> null%0A          - volume_size           = 0 -> null
  ```
  </details>
  *Pusher: @dkhan0103, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*